#include <iostream>
#include <eigen3/Eigen/Dense>
#include <cmath>
#include <vector>

using namespace Eigen;
using namespace std;

// 常量定义
const double PI = M_PI;
const Vector3d GRAVITY(0, 0, 9.8); // 重力向量
const Vector3d Z_AXIS(0, 0, 1);    // Z轴单位向量

// 质量
const double MASS[6] = {0.638856, 0.841, 0.7295, 0.5665, 0.64, 0.000000};//无末端
// const double MASS[6] = {0.638856, 0.841, 0.73, 0.46, 0.39, 0.450};//夹爪末端

// 改进型D-H参数 (常量预先计算)
// a_{i-1},        alpha_{i-1},     d_i,         theta_i
const double DH[6][4] = {
    {0, 0, 0.1088, 0},
    {0, -PI / 2, 0, 0},
    {0.180, PI, 0, 0},
    {0.18881, PI, 0, 0},
    {0.076, PI / 2, -0.011, 0},
    {0, PI / 2, 0.110, 0}};

// 各关节p
const Vector3d p[7] = {
    Vector3d(0.0, 0.0, 0.1005),    // p10
    Vector3d(0.0, 0.0, 0.0),       // p12
    Vector3d(0.1800, 0.0, 0.0),    // p32
    Vector3d(0.1888, 0.0, 0.0),    // p43
    Vector3d(0.080, 0.0110, 0.0), // p54
    Vector3d(0.0, -0.0400, 0.0),   // p65
    Vector3d(0.0, 0.0, 0.0)        // p76
};

// 质心位置 (相对于连杆坐标系)
const Vector3d pc[6] = {
    Vector3d(0, -0.008491, 0.034259), // 连杆1
    Vector3d(0.124560, 0.000000, 0.017699),
    Vector3d(0.15, 0.007521, 0.017264),
    Vector3d(0.08, -0.053910, 0.004474),
    Vector3d(0.013, 0.000000,  -0.007913),
    Vector3d(0.000018, -0.000159, 0.09)
};

// 惯性矩阵(动力学用到)
const Matrix3d INERTIA[6] = {
    (Matrix3d() << 0.000531, 0, 0, 0, 0.000473, 0, 0, 0, 0.000353).finished(),
    (Matrix3d() << 0.000469, 0.000000, -0.000555, 0.000000, 0.004434, 0.000000, -0.000555, 0.000000, 0.004401).finished(),
    (Matrix3d() << 0.000544, -0.000276, -0.000546, -0.000276, 0.004276, 0.000077, -0.000546, 0.000077, 0.004342).finished(),
    (Matrix3d() << 0.000559, -0.000294,  -0.000102, -0.000294, 0.000489, 0.000104, -0.000102, 0.000104, 0.000773).finished(),
    (Matrix3d() << 0.000247, 0.0, 0.000015, 0.0, 0.000250, 0.000000, 0.000015, 0.000000, 0.000171).finished(),
    (Matrix3d() << 0.000395, 0.000002, 0.0, 0.000002, 0.000760, 0.000002, 0.0, 0.000002, 0.000444).finished()};


// 计算静态情况下的重力补偿力矩，具体实现位于 src/6Dof_dyna.cpp。
VectorXd compute_gravity_compensation(const double q[6]);
